Revit 2020 API
ImageView Methods
The ImageView type exposes the following members.
Methods
Name | Description
AddFilter
 Adds a filter to the view.
 (Inherited from View.)
AllowsAnalysisDisplay
 Identifies if this view allows display of Analysis results.
 (Inherited from View.)
ApplyViewTemplateParameters
 Applies to this view the parameters of the input view that are not controlled by the current view template.
 (Inherited from View.)
AreGraphicsOverridesAllowed
 Determines if Visibility/Graphics Overriddes can be applied to the view.
 (Inherited from View.)
ArePhasesModifiable
 Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
 (Inherited from Element.)
CanBeHidden
Indicates if the element can be hidden in the view.
 (Inherited from Element.)
CanBeLocked
 Identifies if the element can be locked.
 (Inherited from Element.)
CanCategoryBeHidden
 Checks whether the category can be hidden in the view.
 (Inherited from View.)
CanCategoryBeHiddenTemporary
 Check if category can be temporarily hidden in the view.
 (Inherited from View.)
CanDeleteSubelement
 Checks if given subelement can be removed from the element.
 (Inherited from Element.)
CanEnableTemporaryViewPropertiesMode
 Indicates if Temporary View Properties mode can be applied for view in current state.
 (Inherited from View.)
CanHaveAnalyticalModel
 Indicates whether the Element can have an Analytical Model.
 (Inherited from Element.)
CanHaveTypeAssigned()
 Identifies if the element can have a type assigned.
 (Inherited from Element.)
CanModifyDetailLevel
 Check if Detail Level can be modified.
 (Inherited from View.)
CanModifyDisplayStyle
 Indicates if DisplayStyle can be modified.
 (Inherited from View.)
CanModifyViewDiscipline
 Indicates if the View Discipline can be modified
 (Inherited from View.)
CanUseDepthCueing
 Indicates if view can use Depth Cueing
 (Inherited from View.)
CanUseTemporaryVisibilityModes
 Indicates if view can use temporary visibility modes
 (Inherited from View.)
CanViewBeDuplicated
 Identifies if this view can be duplicated.
 (Inherited from View.)
ChangeTypeId(ElementId)
 Changes the type of the element.
 (Inherited from Element.)
ConvertTemporaryHideIsolateToPermanent
 Convert all temporary hidden elements or categories to permanently hidden in view.
 (Inherited from View.)
ConvertToIndependent
 Convert the dependent view to independent.
 (Inherited from View.)
Create(Document, ImageTypeOptions)
 Create an ImageView containing an image imported from disk.
Create(Document, String) |  Obsolete.
 Create an ImageView containing an image imported from disk.
CreateViewTemplate
 Creates a new view template instance from this view instance.
 (Inherited from View.)
DeleteEntity
 Deletes the existing entity created by %schema% in the element
 (Inherited from Element.)
DeleteSubelement
 Removes a subelement from the element.
 (Inherited from Element.)
DeleteSubelements
 Removes the subelements from the element.
 (Inherited from Element.)
DisableTemporaryViewMode
 Disables the specified temporary view mode.
 (Inherited from View.)
Dispose |  (Inherited from Element.)
Duplicate
 Duplicates this view.
 (Inherited from View.)
EnableRevealHiddenMode
 Enables Reveal Hidden elements mode.
 (Inherited from View.)
EnableTemporaryViewPropertiesMode
 Turns Temporary View Properties mode on or off. In this mode, any changes made to the view are temporary and will be discarded once the mode is disabled.
 (Inherited from View.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAnalyticalModel
 Retrieves writeable Analytical Model for Element.
 (Inherited from Element.)
GetAnalyticalModelId
 Retrieves the Element Id of the Analytical Model Element for this Element.
 (Inherited from Element.)
GetBackground
 Returns the current background set for the view.
 (Inherited from View.)
GetCategoryHidden
 Checks if elements of the given category are set to be invisible (hidden) in this view.
 (Inherited from View.)
GetCategoryOverrides
 Gets graphic overrides for a category in view.
 (Inherited from View.)
GetCropRegionShapeManager
 Returns an object for managing view crop region shape.
 (Inherited from View.)
GetDependentElements
 Get all elements that, from a logical point of view, are the children of this Element.
 (Inherited from Element.)
GetDependentViewIds
 Get the ids of dependent views.
 (Inherited from View.)
GetDepthCueing
 Returns the current depth cueing settings for the view.
 (Inherited from View.)
GetDirectContext3DHandleOverrides
 Returns DirectContext3D handle overrides object for the view.
 (Inherited from View.)
GetElementOverrides
 Gets graphic overrides for an element in the view.
 (Inherited from View.)
GetEntity
 Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
 (Inherited from Element.)
GetEntitySchemaGuids
 Returns the Schema guids of any Entities stored in this element.
 (Inherited from Element.)
GetExternalFileReference
 Gets information pertaining to the external file referenced by the element.
 (Inherited from Element.)
GetExternalResourceReference
 Gets the ExternalResourceReference associated with a specified external resource type.
 (Inherited from Element.)
GetExternalResourceReferences
 Gets the full map of the external resource references referenced by the element.
 (Inherited from Element.)
GetFilterOverrides
 Gets graphic overrides that a filter applies to the view.
 (Inherited from View.)
GetFilters
 Gets the filters applied to the view.
 (Inherited from View.)
GetFilterVisibility
 Gets the visibility of the elements associated with a filter.
 (Inherited from View.)
GetGeneratingElementIds
 Returns the ids of the element(s) that generated the input geometry object.
 (Inherited from Element.)
GetGeometryObjectFromReference
 Retrieve one geometric primitive contained in the element given a reference.
 (Inherited from Element.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetMaterialArea
 Gets the area of the material with the given id.
 (Inherited from Element.)
GetMaterialIds
 Gets the element ids of all materials present in the element.
 (Inherited from Element.)
GetMaterialVolume
 Gets the volume of the material with the given id.
 (Inherited from Element.)
GetMonitoredLinkElementIds
 Provides the link instance IDs when the element is monitoring.
 (Inherited from Element.)
GetMonitoredLocalElementIds
 Provides the local element IDs when the element is monitoring.
 (Inherited from Element.)
GetNonControlledTemplateParameterIds
 Returns a list of parameters that are not marked as included when this view is used as a template.
 (Inherited from View.)
GetOrderedParameters
 Gets the parameters associated to the element in order.
 (Inherited from Element.)
GetParameterFormatOptions
 Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
 (Inherited from Element.)
GetParameters
Retrieves the parameters from the element via the given name.
 (Inherited from Element.)
GetPhaseStatus
 Gets the status of a given element in the input phase
 (Inherited from Element.)
GetPointCloudOverrides
 Returns point cloud overrides object for the view.
 (Inherited from View.)
GetPrimaryViewId
 Get the id of the primary view.
 (Inherited from View.)
GetReferenceCallouts
 Returns element ids of all reference callouts in the view.
 (Inherited from View.)
GetReferenceElevations
 Returns element ids of all reference elevations in the view.
 (Inherited from View.)
GetReferenceSections
 Returns element ids of all reference sections in the view.
 (Inherited from View.)
GetSketchyLines
 Returns the current sketchy lines settings for the view.
 (Inherited from View.)
GetSubelements
 Returns the collection of element subelements.
 (Inherited from Element.)
GetTemplateParameterIds
 Returns a list of parameter ids that may be controlled when this view is assigned as a template.
 (Inherited from View.)
GetTemporaryViewPropertiesId
 When Temporary View Properties mode is in progress it provides view id that overrode settings for current view. Outside Temporary View Properties mode InvalidElementId will be returned.
 (Inherited from View.)
GetTemporaryViewPropertiesName
 When Temporary View Properties mode is in progress, name of applied template is returned. Outside Temporary View Properties mode, empty string will be returned.
 (Inherited from View.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetTypeId
 Returns the identifier of this element's type.
 (Inherited from Element.)
GetValidTypes()
 Obtains a set of types that are valid for this element.
 (Inherited from Element.)
GetViewDisplayModel
 Returns the current view display model settings for the view.
 (Inherited from View.)
GetWorksetVisibility
 Returns the visibility settings of a workset for this particular view.
 (Inherited from View.)
GetWorksharingDisplayMode
 Gets the current worksharing display mode for this view.
 (Inherited from View.)
HasDetailLevel
 Check if the view has a Detail Level property
 (Inherited from View.)
HasDisplayStyle
 Indicates if view has a DisplayStyle property
 (Inherited from View.)
HasPhases
 Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
 (Inherited from Element.)
HasViewDiscipline
 Indicates if the view has a Discipline property
 (Inherited from View.)
HideActiveWorkPlane
Hide the active work plane of the view.
 (Inherited from View.)
HideCategoriesTemporary
 Set multiple categories to be temporarily hidden in the view.
 (Inherited from View.)
HideCategoryTemporary
 Set one category to be temporarily hidden in the view.
 (Inherited from View.)
HideElements
Sets the elements to be hidden in the view.
 (Inherited from View.)
HideElementsTemporary
 Set multiple elements to be temporarily hidden in the view. To hide a group completely, you must also include all members of all groups and nested groups in your input.
 (Inherited from View.)
HideElementTemporary
 Set one element to be temporarily hidden in the view. To hide a group completely, you must also include all members of all groups and nested groups in your input, therefore you should use the version of this method that accepts multiple element ids as input.
 (Inherited from View.)
IsCategoryOverridable
 Checks whether the category can have graphic overrides in this view.
 (Inherited from View.)
IsElementVisibleInTemporaryViewMode
 Identifies if the input element is visible for the temporary view mode for this view.
 (Inherited from View.)
IsExternalFileReference
 Determines whether this Element represents an external file.
 (Inherited from Element.)
IsFilterApplied
 Indicates if a filter is applied to the view.
 (Inherited from View.)
IsHidden
Identifies if the element has been permanently hidden in the view.
 (Inherited from Element.)
IsInTemporaryViewMode
 Returns true if the view is in a particular temporary view mode.
 (Inherited from View.)
IsMonitoringLinkElement
 Indicate whether an element is monitoring any elements in any linked models.
 (Inherited from Element.)
IsMonitoringLocalElement
 Indicate whether an element is monitoring other local elements.
 (Inherited from Element.)
IsolateCategoriesTemporary
 Set categories to be temporarily isolated in the view.
 (Inherited from View.)
IsolateCategoryTemporary
 Set one category to be temporarily isolated in the view.
 (Inherited from View.)
IsolateElementsTemporary
 Set multiple elements to be temporarily isolated in the view. To isolate a group completely, you must also include all members of all groups and nested groups in your input.
 (Inherited from View.)
IsolateElementTemporary
 Set one element to be temporarily isolated in the view. To isolate a group completely, you must also include all members of all groups and nested groups in your input, therefore you should use the version of this method that accepts multiple element ids as input.
 (Inherited from View.)
IsPhaseCreatedValid
 Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
 (Inherited from Element.)
IsPhaseDemolishedValid
 Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
 (Inherited from Element.)
IsTemporaryHideIsolateActive
 Indicates if the view is temporarily hiding or isolating elements or categories.
 (Inherited from View.)
IsTemporaryViewPropertiesModeEnabled
 Returns true when Temporary View Properties mode is in progress, false otherwise.
 (Inherited from View.)
IsValidType(ElementId)
 Checks if given type is valid for this element.
 (Inherited from Element.)
IsValidViewTemplate
 Verifies that the view represented by templateId can be set as the controlling view template for this view.
 (Inherited from View.)
IsViewValidForTemplateCreation
 Verifies that the view is valid for template creation.
 (Inherited from View.)
IsWorksetVisible
 Indicates whether the workset is visible in this view.
 (Inherited from View.)
LookupParameter
Attempts to find a parameter on the element which has the given name.
 (Inherited from Element.)
Print()
Print this view with the default view template and using the print setting of the current active document.
 (Inherited from View.)
Print(Boolean)
Print this view with the default view template, and either the view's document's print setting or the print setting of the current active document.
 (Inherited from View.)
Print(View)
Print this view with the given view template and using the print setting of the current active document.
 (Inherited from View.)
Print(View, Boolean)
Print this view with the given view template, and either the view's document's print setting or the print setting of the current active document.
 (Inherited from View.)
RefersToExternalResourceReference
 Determines whether this Element uses external resources associated with a specified external resource type.
 (Inherited from Element.)
RefersToExternalResourceReferences
 Determines whether this Element uses external resources.
 (Inherited from Element.)
RemoveFilter
 Removes a filter from the view.
 (Inherited from View.)
SetBackground
 Sets the background for the view. Background can only be set for 3d views and for Sections/Elevations.
 (Inherited from View.)
SetCategoryHidden
 Sets if elements of the given category will be visible in this view.
 (Inherited from View.)
SetCategoryOverrides
 Sets graphic overrides for a category in view.
 (Inherited from View.)
SetDepthCueing
 Sets the depth cueing settings for the view.
 (Inherited from View.)
SetElementOverrides
 Sets graphic overrides for an element in the view.
 (Inherited from View.)
SetEntity
 Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
 (Inherited from Element.)
SetFilterOverrides
 Sets the overrides associated with a filter.
 (Inherited from View.)
SetFilterVisibility
 Sets the visibility of the elements associated with a filter.
 (Inherited from View.)
SetNonControlledTemplateParameterIds
 Sets the parameters that will not be included when this view is used as a template.
 (Inherited from View.)
SetSketchyLines
 Sets the sketchy lines settings for the view.
 (Inherited from View.)
SetViewDisplayModel
 Sets the view display model settings for the view.
 (Inherited from View.)
SetWorksetVisibility
 Sets visibility for a workset in this view.
 (Inherited from View.)
SetWorksharingDisplayMode
 Sets the worksharing display mode for this view.
 (Inherited from View.)
ShowActiveWorkPlane
Show the active work plane of the view.
 (Inherited from View.)
SupportsRevealConstraints
 Checks that the view can have the Reveal Constraints mode activated.
 (Inherited from View.)
SupportsWorksharingDisplayMode
 Checks whether this view supports the given worksharing display mode.
 (Inherited from View.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
UnhideElements
Sets the elements to be shown in the given view if they are currently hidden.
 (Inherited from View.)
See Also
ImageView Class
Autodesk.Revit.DB Namespace